modm-ext/data.modm.io/docs/svd/header_stm32f070x6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>Universal Serial Bus Full Speed Device</description>
      <groupName>USB</groupName>
      <baseAddress>0x40005c00</baseAddress>
      <interrupt>
        <name>USB</name>
        <description>USB global Interrupt &amp; EXTI Line18 Interrupt</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>EP0R</name>
          <description>USB Endpoint 0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP1R</name>
          <description>USB Endpoint 1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP2R</name>
          <description>USB Endpoint 2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP3R</name>
          <description>USB Endpoint 3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP4R</name>
          <description>USB Endpoint 4 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP5R</name>
          <description>USB Endpoint 5 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP6R</name>
          <description>USB Endpoint 6 register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP7R</name>
          <description>USB Endpoint 7 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CNTR</name>
          <description>Control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ISTR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FNR</name>
          <description>Frame number register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DADDR</name>
          <description>Device address register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BTABLE</name>
          <description>Buffer Table address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>LPMCSR</name>
          <description>LPM Control and Status register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCDR</name>
          <description>Battery Charging detector register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x40007000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>PWR power control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPDS</name>
              <description>Low-power Deepsleep</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>Voltage Regulator in main mode during deepsleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_POWER</name>
                  <description>Voltage Regulator in low-power mode during deepsleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDS</name>
              <description>Power Down Deepsleep</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWUF</name>
              <description>Clear Wakeup Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSBF</name>
              <description>Clear Standby Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable Backup Domain write protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>PWR power control/status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WUF</name>
              <description>Wakeup Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF</name>
              <description>Standby Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP1</name>
              <description>Enable WKUP pin 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP2</name>
              <description>Enable WKUP pin 2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
